IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
    // 成功发送后递增帧序号，为下一帧准备
    s_camera_rtos_frame_id++;
    return CAMERA_RTOS_ERR_NONE;   // 全部流程顺利完成，返回无错误标志
}

// 文本和二进制请求共用同一条 DUMP 执行路径，并在入口执行SNAPSHOT软件保护
static uint8_t Camera_RTOS_ProcessDumpRequest(uint8_t request_source)
{
#if (CAMERA_SD_DIAG_SD_ONLY_BOOT != 0U)
    static const uint8_t sd_only_text[] =
        "DUMP blocked: SD_ONLY_BOOT_NO_CAMERA.\r\n";
#endif
    static const uint8_t blocked_text[] =
        "DUMP blocked: snapshot software guard active.\r\n";
    uint32_t error_code;
    uint32_t dump_start_tick;
    uint32_t dump_elapsed_ms;

    Camera_RTOS_RecordDumpRequest();

#if (CAMERA_SD_DIAG_SD_ONLY_BOOT != 0U)
    if (request_source == CAMERA_RTOS_DUMP_SOURCE_BINARY)
    {
        Camera_SnapshotControl_RecordBinaryBlocked();
    }
    else
    {
        Camera_SnapshotControl_RecordDumpBlocked();
    }

    if (s_camera_rtos_uart != NULL)
    {
        (void)HAL_UART_Transmit(
            s_camera_rtos_uart,
            (uint8_t *)sd_only_text,
            (uint16_t)(sizeof(sd_only_text) - 1U),
            HAL_MAX_DELAY);
    }

    s_camera_rtos_stats.last_dump_time_ms = 0U;
    Camera_RTOS_RecordDumpError(CAMERA_RTOS_ERR_SD_ONLY_BOOT_NO_CAMERA);
    return 0U;
#endif

    if (Camera_SnapshotControl_IsDumpAllowed() == 0U)
    {
        if (request_source == CAMERA_RTOS_DUMP_SOURCE_BINARY)
        {
            Camera_SnapshotControl_RecordBinaryBlocked();
        }
        else
        {
            Camera_SnapshotControl_RecordDumpBlocked();
            if (s_camera_rtos_uart != NULL)
            {
                (void)HAL_UART_Transmit(
                    s_camera_rtos_uart,
                    (uint8_t *)blocked_text,
                    (uint16_t)(sizeof(blocked_text) - 1U),
                    HAL_MAX_DELAY);
            }
        }

        s_camera_rtos_stats.last_dump_time_ms = 0U;
        Camera_RTOS_RecordDumpError(CAMERA_RTOS_ERR_SNAPSHOT_GUARD_ACTIVE);
        return 0U;
    }

    dump_start_tick = HAL_GetTick();
    error_code = Camera_RTOS_PrepareAndSend();
    dump_elapsed_ms = HAL_GetTick() - dump_start_tick;
    Camera_RTOS_UpdateCameraServiceStackStats();
    if (error_code == CAMERA_RTOS_ERR_NONE)
    {
        Camera_RTOS_RecordDumpSuccess(dump_elapsed_ms);
        return 1U;
    }

    s_camera_rtos_stats.last_dump_time_ms = dump_elapsed_ms;
    Camera_RTOS_RecordDumpError(error_code);
    return 0U;
}

// 记录合法二进制请求，序号仅用于请求统计
static void Camera_RTOS_RecordBinaryRequest(
    const ImageRequestFrame_t *request)
{
    s_camera_rtos_stats.binary_request_count++;
    s_camera_rtos_stats.last_binary_request_seq = request->seq;
}

// 记录二进制解析错误并更新分类计数
static void Camera_RTOS_RecordBinaryError(
    ImageRequestParseResult_t parse_result)
{
    s_camera_rtos_stats.binary_request_error_count++;
    s_camera_rtos_stats.last_binary_error_code = (uint32_t)parse_result;

    switch (parse_result)
    {
        case IMAGE_REQUEST_PARSE_CRC_ERROR:
            s_camera_rtos_stats.binary_request_crc_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_VERSION_ERROR:
            s_camera_rtos_stats.binary_request_version_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_TYPE_ERROR:
            s_camera_rtos_stats.binary_request_type_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_LENGTH_ERROR:
            s_camera_rtos_stats.binary_request_length_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_EOF_ERROR:
            s_camera_rtos_stats.binary_request_eof_error_count++;
            break;

        default:
            break;
    }
}

// 记录二进制半帧超时，不发送任何文本响应
static void Camera_RTOS_RecordBinaryTimeout(void)
{
    s_camera_rtos_stats.binary_request_timeout_count++;
    s_camera_rtos_stats.last_binary_error_code = IMAGE_REQUEST_PARSE_TIMEOUT;
}

// 将一个文本字节送入现有命令解析器
static void Camera_RTOS_ProcessTextByte(uint8_t byte)
{
    uint8_t command;

    command = Camera_PC_Dump_FeedCommandByte(s_camera_rtos_uart, byte);
    if (command == CAMERA_PC_DUMP_CMD_PENDING)
    {
        Camera_RTOS_RecordUartPending();
        return;
    }

    // CLI 命令已在文本行解析器内部处理
    if (command == CAMERA_PC_DUMP_CMD_CLI)
    {
        return;
    }

    if (command == CAMERA_PC_DUMP_CMD_DUMP)
    {
        (void)Camera_RTOS_ProcessDumpRequest(CAMERA_RTOS_DUMP_SOURCE_TEXT);
        return;
    }

    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
}

// 处理分发器产生的单个业务事件
static void Camera_RTOS_ProcessDispatchEvent(
    CameraUartDispatchResult_t result,
    const CameraUartDispatchEvent_t *event)
{
    switch (result)
    {
        case CAMERA_UART_DISPATCH_TEXT_BYTE:
            Camera_RTOS_ProcessTextByte(event->text_byte);
            break;

        case CAMERA_UART_DISPATCH_IMAGE_REQUEST:
            Camera_RTOS_RecordBinaryRequest(&event->image_request);
            if (Camera_RTOS_ProcessDumpRequest(
                    CAMERA_RTOS_DUMP_SOURCE_BINARY) != 0U)
            {
                s_camera_rtos_stats.binary_request_success_count++;
            }
            break;

        case CAMERA_UART_DISPATCH_BINARY_ERROR:
            Camera_RTOS_RecordBinaryError(event->binary_result);
            break;

        case CAMERA_UART_DISPATCH_BINARY_TIMEOUT:
            Camera_RTOS_RecordBinaryTimeout();
            break;

        case CAMERA_UART_DISPATCH_BAD_ARGUMENT:
            s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
            break;

        case CAMERA_UART_DISPATCH_NONE:
        default:
            break;
    }
}

// 初始化摄像头 RTOS 模块（保存 UART 句柄，重置统计和帧号）
void Camera_RTOS_Init(UART_HandleTypeDef *huart)
{
    s_camera_rtos_uart = NULL;
    s_camera_rtos_frame_id = 1U;
    Camera_RTOS_ClearStats();

    if (huart == NULL)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_NULL;
        return;
    }

    s_camera_rtos_uart = huart;
}

// 在调度器启动前配置并启动IWDG，运行期仅由MonitorTask刷新
HAL_StatusTypeDef Camera_RTOS_IwdgInit(void)
{
    HAL_StatusTypeDef status;

    s_camera_rtos_iwdg.Instance = IWDG;
    s_camera_rtos_iwdg.Init.Prescaler = CAMERA_RTOS_IWDG_PRESCALER;
    s_camera_rtos_iwdg.Init.Reload = CAMERA_RTOS_IWDG_RELOAD;

    status = HAL_IWDG_Init(&s_camera_rtos_iwdg);
    if (status == HAL_OK)
    {
        s_camera_rtos_stats.iwdg_enabled = 1U;
    }

