IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
    return status;
}

// 摄像头服务任务（FreeRTOS 任务主循环）
// 功能：管理 UART 命令接收、DMA 数据传输、命令解析及图像采集触发
void Camera_RTOS_CameraServiceTask(void *argument)
{
    uint8_t rx_chunk[CAMERA_RTOS_UART_RX_CHUNK_SIZE];    // 用于从 DMA 环形缓冲区读取数据的临时块
    size_t received;                                     // 本次实际读取的字节数
    size_t i;                                            // 循环索引
    uint32_t stack_sample_tick;                          // 上次采样栈使用量的时间戳
    uint32_t current_tick;                               // 当前时间戳
    CameraUartDispatchEvent_t dispatch_event;            // 解析器产生的事件（如收到完整命令）
    CameraUartDispatchResult_t dispatch_result;          // 解析器处理单字节的返回结果

    (void)argument;  // 未使用的参数，避免编译警告

    // 初始化 UART 命令分发器（负责解析字节流、识别命令帧）
    CameraUartDispatcher_Init(&s_camera_uart_dispatcher);
    // 重置 PC Dump 命令解析器的内部状态（清空缓存行）
    Camera_PC_Dump_ResetCommandParser();

    // 等待 UART 句柄被外部初始化（Camera_RTOS_Init 设置）
    // 若句柄为空，则记录错误并延时重试
    while (s_camera_rtos_uart == NULL)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_NULL;
        (void)osDelay(1000U);
    }

    // 初始化 UART DMA 接收（配置 DMA 环形缓冲区，启动连续接收）
    // 若初始化失败，则记录错误并反复重试
    while (UART_RxDma_Init(s_camera_rtos_uart) != HAL_OK)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_DMA_INIT;
        (void)osDelay(1000U);
    }

    // 首次采样并更新任务栈使用统计（用于监控堆栈溢出）
    Camera_RTOS_UpdateCameraServiceStackStats();
    stack_sample_tick = HAL_GetTick();

    // 主循环：反复从 DMA 环形缓冲区读取数据，送入解析器处理
    for (;;)
    {
        // 每轮主循环更新心跳；本轮只记录状态，不做卡死判定或复位
        s_camera_rtos_stats.camera_service_heartbeat_count++;
        s_camera_rtos_stats.camera_service_heartbeat_ms = HAL_GetTick();

        // 检测并恢复 UART 输入错误（如帧错误、噪声等）
        if (Camera_RTOS_RecoverUartInputIfNeeded() != 0U)
        {
            continue;  // 若恢复过程中发现问题，重新开始循环
        }

        // 检测并丢弃因缓冲区溢出丢失的输入（避免解析器状态混乱）
        if (Camera_RTOS_DiscardOverflowedInput() != 0U)
        {
            continue;
        }

        // 从 DMA 环形缓冲区读取一块数据（非阻塞，带超时）
        received = UART_RxDma_Read(rx_chunk,
                                   sizeof(rx_chunk),
                                   CAMERA_RTOS_UART_READ_TIMEOUT_MS);
        if (received == 0U)
        {
            // 读取超时或暂无数据：
            // 先再次检查并恢复可能的错误/溢出（因为在等待期间可能发生）
            if ((Camera_RTOS_RecoverUartInputIfNeeded() != 0U) ||
                (Camera_RTOS_DiscardOverflowedInput() != 0U))
            {
                continue;
            }
            // 检查命令解析器是否因超时而产生事件（例如半帧超时）
            dispatch_result = CameraUartDispatcher_CheckTimeout(
                &s_camera_uart_dispatcher,
                HAL_GetTick(),
                &dispatch_event);
            // 处理解析器产生的事件（若有效）
            Camera_RTOS_ProcessDispatchEvent(dispatch_result, &dispatch_event);
            // 记录一次“无数据”事件（用于统计空闲次数）
            Camera_RTOS_RecordUartNone();

            // 周期采样任务栈使用量（例如每秒一次）
            current_tick = HAL_GetTick();
            if ((current_tick - stack_sample_tick) >=
                CAMERA_RTOS_STACK_SAMPLE_PERIOD_MS)
            {
                Camera_RTOS_UpdateCameraServiceStackStats();
                stack_sample_tick = current_tick;
            }
            continue;  // 本次循环结束，等待下一轮读取
        }

        // 处理读取到的每一个字节
        for (i = 0U; i < received; ++i)
        {
            // 在每字节处理前，检查是否有新的错误/溢出发生，若有则放弃当前块
            if ((Camera_RTOS_RecoverUartInputIfNeeded() != 0U) ||
                (Camera_RTOS_DiscardOverflowedInput() != 0U))
            {
                break;  // 退出循环，丢弃剩余字节
            }

            // 将当前字节送入命令分发器解析
            dispatch_result = CameraUartDispatcher_FeedByte(
                &s_camera_uart_dispatcher,
                rx_chunk[i],
                HAL_GetTick(),
                &dispatch_event);
            // 处理解析器返回的事件（如完整命令、错误等）
            Camera_RTOS_ProcessDispatchEvent(dispatch_result, &dispatch_event);
        }

        // 周期采样任务栈使用量
        current_tick = HAL_GetTick();
        if ((current_tick - stack_sample_tick) >=
            CAMERA_RTOS_STACK_SAMPLE_PERIOD_MS)
        {
            Camera_RTOS_UpdateCameraServiceStackStats();
            stack_sample_tick = current_tick;
        }
    }
}

// MonitorTask：每 1000 ms 更新心跳计数，不使用 UART。
void Camera_RTOS_MonitorTask(void *argument)
{
    uint32_t current_tick;

    (void)argument;

    for (;;)
    {
        (void)osDelay(1000U);
        s_camera_rtos_stats.uptime_ms += 1000U;
        // 每个监控周期更新心跳，不改变原有健康采样周期
        s_camera_rtos_stats.monitor_heartbeat_count++;
        current_tick = HAL_GetTick();
        s_camera_rtos_stats.monitor_heartbeat_ms = current_tick;
        Camera_RTOS_UpdateMonitorHealthStats();
        Camera_RTOS_ServiceIwdg(current_tick);
    }
}

// 获取运行统计信息的只读指针
const CameraRtosStats_t *Camera_RTOS_GetStats(void)
{
    uint32_t current_tick = HAL_GetTick();

    // 获取状态时计算心跳年龄；tick异常回退时按0处理，避免无符号下溢
    Camera_RTOS_UpdateHeartbeatAges(current_tick);

    return &s_camera_rtos_stats;
}
